NB! shut/no shut + cop run st

ACCESS-SWITCH

1
Check VLANs - Finnes riktige VLAN og er de aktive på riktig port?
S1#sh(ow) vl(an) b(rief)
sh vl b

2
check VLAN, duplex and ports - Sjekk at både switch og PC står på Auto Duplex og Auto Speed. Disse må 
være like begge steder og de må ha samme hastighet. Hvis en port er i "port err-disabled" gå rett til punkt 5.
S1#sh(ow) int(erface) st(atus)
sh int st

3
Check trunk - Sjekk at trunk bruker dot1Q encapsulation, at riktige vlan er allowed og active, og at 
begge sider av trunken har samme native VLAN.
S1#sh(ow) int(erface) t(runk)
sh int t

3,5
Sjekk at enheten kan nå andre ønskede enheter.
SW1# sh(ow) cdp n(eighbors)
sh cdp neig
SW1# show cdp neighbors detail
ping fra klient
ping loopback address
ping default gateway (router)
ping remote server

4
Check default GW - sjekk at enheten har en default gateway. 
S1# show ip default-gateway
show ip default-gateway

5
check port security
S1# sh(ow) po(rt-security) i(nterface) f0/5
eller
S1# show port-security interface e0/1 address
S1# sh(ow) po(rt-security) a(ddress)
(hvis adressen har vært feil, men nå er rettet opp, må en ta shut + no shut for å oppdatere og åpne linken)
show port-security

7
check etherchannel 
S1# sh(ow) et(herchannel) s(ummary)
eller
S1#show etherchannel 1 summary
show etherchannel summary

8
check mac address table
S1#sh mac ad(dress-table)
(etter ping)
show mac address-table

9
Switch# show dhcp lease
Viser hvilke DHCP lease enheter tilknyttet svitsjen har
show dhcp lease


RUTER

10
ping <ip> source <interface>
sh ip helper

11
Check VLANs
R1#sh(ow) vl(an)
show vlan

12
check VLAN and ports
R1#sh in st(atus)
R1# sh(ow) ip in(terface) br(ief)
show interface status
show ip interface brief

13
Check trunk
R1#sh(ow) in(terface) t(runk)
show interface trunk

14
check routing table
R1#show ip ro(ute)
show ip route
hvis rute mangler, sjekk om ospf er aktivert
R1#show ip protocols

15
check access list
R1#show ac(cess-lists)
show access-lists

16
check vrf
R1#show vrf
show vrf

17
check mac address table
R1#sh arp
(etter ping)
show arp

18
check open ports
There are several open TCP ports: 22 for SSH, 23 for Telnet, 80 for HTTP, and 443 for HTTPS; as well as UDP port 123 for NTP.
R1# show control-plane host open-ports


19
telnet/ssh

ssh -l admin 10.10.1.1
Password: Cisco123
R1> logout

ssh -l admin 10.10.1.1
Cisco123
logout

